/*-------------------------------------------------------------------------------
需求：
思路：
-------------------------------- 2018.4.25 ------------------------------------*/
#include "MYLIB_Define.h"
//------------------------------------------------------------------------输入变量


//------------------------------------------------------------------------输出变量

//------------------------------------------------------------------------私有变量

/*------------------------------------------------------------------------------
函数名：Dome
功  能：xx
参  数：xx
返回值：无
创建者:	林广云
建时间：20180516
------------------------------------------------------------------------------*/
  
/*------------------------------------------------------------------------------
函数名： 	IEEE754_Buf_To_Float(void）
功能：	 	IEEE754数组转双精美浮点
参数：     	P 缓存接收指针
返回值：	IEEE754_Data
创建者:		林广云
创建时间：  2018年7月18日

IEEE754标准通讯加密算法:

//--------------------步骤1：结构体定义
typedef union                                        
{
   float ul_Temp;
   uint8_t  uc_Buf[4];
}TYP_IEEE754;
TYP_IEEE754   IEEE754_Data;

//---------------------------------用法1：数组转单精度浮点
//--------------------输入变量
unsigned char OUT_Byte[4]={0x00,0x00,0x5C,0x43};

//--------------------调用方法
memcpy(IEEE754_Data.uc_Buf,OUT_Byte,4);

//--------------------输出结果
 你想知道的 = IEEE754_Data.ul_Temp;

//---------------------------------用法2:单精度浮点转数组
//--------------------输入变量
IEEE754_Data.ul_Temp = 220.0;

//--------------------调用方法
memcpy(OUT_Byte,IEEE754_Data.uc_Buf,4);

//--------------------输出结果
 你想知道的[] = IEEE754_Data.uc_Buf[];
 
//---------------------------------

问题：
	1.在MCUbit8中高字节在前，低字节在后，在MCUbit32中高字节在后，低字节在前。
	2.在使用函数分离的时候函数会莫名变成隐性，故障非常奇怪，但是不影响正常使用。
注意：隐性声明一旦出Bug就是凉凉，不报错!所以直接放在运行模块区域，不做单独应用
	
//-----------------------原型函数
unsigned char OUT_Byte[4]={0x43,0x5C,0x00,0x00};

void IEEE754_Buf_To_Float(unsigned char *Pointer)  
{
	memcpy(IEEE754_Data.uc_Buf,Pointer,4);
}
------------------------------------------------------------------------------*/  
/*

i = (x^(x>>31))-(x>>31);//x<0?-x:x

*/



/*------------------------------------------------------------------------------
函数名： 	ClearReeceiveBuf(void）
功能：	 	清数组
参数：     	P 缓存接收指针
返回值：	无
创建者:		林广云
创建时间：  20180516
------------------------------------------------------------------------------*/
void ClearReeceiveBuf(unsigned char *Pointer,unsigned char BUF_Size)
{
	unsigned int i;
	for( i=0;i<BUF_Size;i++) //清接收缓冲区
	{
		Pointer[i]=0;
	}
}


/*------------------------------------------------------------------------------
函数名： 	Calculation_CheckSum(void）
功能：	 	计算校验和
参数：     	P 缓存接收指针
返回值：	无
创建者:		林广云
创建时间：  20180516
------------------------------------------------------------------------------*/
unsigned char Calculation_CheckSum(unsigned char *Pointer,unsigned char BUF_Size)
{
	unsigned int ix;
	unsigned char CheckSum = 0;

	for(ix=0;ix<BUF_Size-1;ix++)
		CheckSum = CheckSum + Pointer[ix];
		return(CheckSum);
}

/*------------------------------------------------------------------------------
函数名：Modbus_CRC16_L
功  能：计算CRC，计算结果低字节在前
参  数：xx
返回值：无
创建者:	林广云
建时间：20180516
------------------------------------------------------------------------------*/
unsigned int  Modbus_CRC16_L( unsigned char *Pointer, unsigned char BUF_Size)
{
    unsigned int crc = 0xFFFF;
	
    unsigned char ix, jx;
	
    for ( jx = 0; jx < BUF_Size ; jx++) 
	{
        crc = crc ^ *Pointer++;
        for (ix = 0; ix < 8; ix++)
		{
            if((crc & 0x0001) >0) 
			{
                crc = crc >> 1;
                crc = crc ^ 0xa001;
            } 
			else 
			{
                crc = crc >> 1;
            }
        }
    }
	
    return(crc);
} 
/*------------------------------------------------------------------------------
unsigned short int

unsigned short int Average64_Value_Calculation(unsigned short int *Pointer)
{
	unsigned char Temp_i;
	unsigned short int Return_Data = 0;
	for (Temp_i = 0; Temp_i < 64; Temp_i++)
	{
		Return_Data += Pointer[Temp_i];
	}
	return Return_Data >> 6;
}
------------------------------------------------------------------------------*/
/*------------------------------------------------------------------------------
CLK->AHBCLK |= CLK_AHBCLK_HDIV_EN_Msk;	

signed int DIVIDEND_APP(signed int DiviDend, signed int DiviSor)
{
	return HDIV_Div(DiviDend, DiviSor);
}


------------------------------------------------------------------------------*/
/*------------------------------------------------------------------------------
------------------------------------------------------------------------------*/
/******************* (C)  2018.4.25  *****END OF FILE****/
